# Titanic Dataset from Seaborn
Seaborn is a Python data visualization library based on matplotlib. It provides a high-level interface for drawing attractive and informative statistical graphics.

Seaborn helps you explore and understand your data. Its plotting functions operate on dataframes and arrays containing whole datasets and internally perform the necessary semantic mapping and statistical aggregation to produce informative plots. Its dataset-oriented, declarative API lets you focus on what the different elements of your plots mean, rather than on the details of how to draw them.

In [1]:
# import libraries
import pandas as pd
import seaborn as sns
import numpy as np
from scipy import stats as st

In [2]:
# Load the titanic dataset into a Pandas DataFrame
titanic_dataset = sns.load_dataset('titanic')

# Print Data Type
print("Data Type: ", type(titanic_dataset))

# Print First 5 Rows of the data set
print(titanic_dataset.head())

Data Type:  <class 'pandas.core.frame.DataFrame'>
   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [3]:
#Create a new column called is_child, which is derived using 'age' column
titanic_dataset['is_child'] = titanic_dataset["age"].apply(lambda age: True if age < 18 else False)
print("Data Frame After adding a new column")
print(titanic_dataset.head())

Data Frame After adding a new column
   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone  is_child
0    man        True  NaN  Southampton    no  False     False
1  woman       False    C    Cherbourg   yes  False     False
2  woman       False  NaN  Southampton   yes   True     False
3  woman       False    C  Southampton   yes  False     False
4    man        True  NaN  Southampton    no   True     False

In [4]:
#Concatenate a new row in the data frame
new_row = pd.DataFrame({"surived":[0], "pclass" : [1], "sex" : ["male"], "age" : [72], "sibsp": [1], "parch" : [0], "fare" : [126.00], "embarked" : ["S"], "class" : ["First"], "who" : ["man"],
                        "adult_male" : [True], "deck" : [None], "embark_town" : ["Richmond"], "alive" : ["no"], "alone" : [False], "is_child" : [False]})

titanic_concatenated_data_set = pd.concat([titanic_dataset, new_row], ignore_index=True)
print("Concatenated DataFrame:\n")
print(titanic_concatenated_data_set.tail())

Concatenated DataFrame:

     survived  pclass     sex   age  sibsp  parch    fare embarked  class  \
887       1.0       1  female  19.0      0      0   30.00        S  First
888       0.0       3  female   NaN      1      2   23.45        S  Third
889       1.0       1    male  26.0      0      0   30.00        C  First
890       0.0       3    male  32.0      0      0    7.75        Q  Third
891       NaN       1    male  72.0      1      0  126.00        S  First

       who  adult_male deck  embark_town alive  alone  is_child  surived
887  woman       False    B  Southampton   yes   True     False      NaN
888  woman       False  NaN  Southampton    no  False     False      NaN
889    man        True    C    Cherbourg   yes   True     False      NaN
890    man        True  NaN   Queenstown    no   True     False      NaN
891    man        True  NaN     Richmond    no  False     False      0.0

/tmp/ipykernel_4045/3011189391.py:5: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  titanic_concatenated_data_set = pd.concat([titanic_dataset, new_row], ignore_index=True)

In [5]:
# To fix FutureWarning Error on The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.

# Remove empty columns before concatenating

new_row_cleaned = new_row.dropna(axis=1, how='all') 

titanic_concatenated_data_set = pd.concat([titanic_dataset, new_row_cleaned], ignore_index=True)
print("Concatenated DataFrame:\n")
print(titanic_concatenated_data_set.tail())

Concatenated DataFrame:

     survived  pclass     sex   age  sibsp  parch    fare embarked  class  \
887       1.0       1  female  19.0      0      0   30.00        S  First
888       0.0       3  female   NaN      1      2   23.45        S  Third
889       1.0       1    male  26.0      0      0   30.00        C  First
890       0.0       3    male  32.0      0      0    7.75        Q  Third
891       NaN       1    male  72.0      1      0  126.00        S  First

       who  adult_male deck  embark_town alive  alone  is_child  surived
887  woman       False    B  Southampton   yes   True     False      NaN
888  woman       False  NaN  Southampton    no  False     False      NaN
889    man        True    C    Cherbourg   yes   True     False      NaN
890    man        True  NaN   Queenstown    no   True     False      NaN
891    man        True  NaN     Richmond    no  False     False      0.0

## Descriptive Statistics of Titanic Data Set

In [6]:
# Calculate Basic Statistics 
# Central Tendancy - Mean, Median and Mode
# Mean - Average of Given Values
print("Data Type: ", type(titanic_dataset))
mean_age = titanic_dataset["age"].mean()
print("Mean of Age: ", mean_age)
# Median - Middle value 
median_age = titanic_dataset["age"].median()
print("Median of Age: ", median_age)
# Mode - Most Frequency Occuring Value
mode_age = titanic_dataset["age"].mode()[0]
print("Mode of Age: ", mode_age)

Data Type:  <class 'pandas.core.frame.DataFrame'>
Mean of Age:  29.69911764705882
Median of Age:  28.0
Mode of Age:  24.0

## Measures of Variability: Standard Deviation

In [7]:
# Measures of Dispersion (Variability)

# The most common way to gauge the variability is via Standard Deviation

# Standard Deviation - Measures how much the values in the dataset vary around the mean

std_deviation_age = np.std(titanic_dataset["age"])
print(f"Standard Deviation of Age is {std_deviation_age}")

Standard Deviation of Age is 14.516321150817316

### Quartiles and Percentails

In [8]:
# Percentails - Using NumPy
# dropna function will drop NA values
total_percentail_age_np = np.percentile(titanic_dataset["age"].dropna(), 99)
print(f"99th Percentail of Age using numpy: {total_percentail_age_np}")

quartile1_age_np = np.percentile(titanic_dataset["age"].dropna(), 25)
print(f"First Percentail of Age using numpy: {quartile1_age_np}")

quartile3_age_np = np.percentile(titanic_dataset["age"].dropna(), 75)
print(f"Third Percentail of Age using numpy: {quartile3_age_np}")

99th Percentail of Age using numpy: 65.87
First Percentail of Age using numpy: 20.125
Third Percentail of Age using numpy: 38.0

In [9]:
# Percentails - Using Pandas
# dropna function will drop NA values
total_percentail_age_np = titanic_dataset["age"].quantile(0.99)
print(f"99th Percentail of Age using numpy: {total_percentail_age_np}")

quartile1_age_np = titanic_dataset["age"].quantile(0.25)
print(f"First Percentail of Age using numpy: {quartile1_age_np}")

quartile3_age_np = titanic_dataset["age"].quantile(0.75)
print(f"Third Percentail of Age using numpy: {quartile3_age_np}")

99th Percentail of Age using numpy: 65.87
First Percentail of Age using numpy: 20.125
Third Percentail of Age using numpy: 38.0

In [10]:
# Descriptive Stats of Fares
age_fare_sub_dataset = titanic_dataset[['age', 'fare']]

# Calcualte mean, median and mode of age and fare columns in the titanic data set
print(f'Mean of age and fare', age_fare_sub_dataset.mean())
print(f'Median of age and fare', age_fare_sub_dataset.median())
print(f'Mode of age and fare', age_fare_sub_dataset.mode().iloc[0])

Mean of age and fare age     29.699118
fare    32.204208
dtype: float64
Median of age and fare age     28.0000
fare    14.4542
dtype: float64
Mode of age and fare age     24.00
fare     8.05
Name: 0, dtype: float64

## Data Filtering

In [12]:
# Filter passengers by servived
survivors = titanic_dataset [ titanic_dataset['survived'] == True]

print(survivors.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
1         1       1  female  38.0      1      0  71.2833        C   First
2         1       3  female  26.0      0      0   7.9250        S   Third
3         1       1  female  35.0      1      0  53.1000        S   First
8         1       3  female  27.0      0      2  11.1333        S   Third
9         1       2  female  14.0      1      0  30.0708        C  Second

     who  adult_male deck  embark_town alive  alone  is_child
1  woman       False    C    Cherbourg   yes  False     False
2  woman       False  NaN  Southampton   yes   True     False
3  woman       False    C  Southampton   yes  False     False
8  woman       False  NaN  Southampton   yes  False     False
9  child       False  NaN    Cherbourg   yes  False      True

### Multiple Conditions in Data Filtering

In [23]:
female_survivors = titanic_dataset[(titanic_dataset['survived'] == True) & (titanic_dataset['sex'] == 'female')]

print(female_survivors.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
1         1       1  female  38.0      1      0  71.2833        C   First
2         1       3  female  26.0      0      0   7.9250        S   Third
3         1       1  female  35.0      1      0  53.1000        S   First
8         1       3  female  27.0      0      2  11.1333        S   Third
9         1       2  female  14.0      1      0  30.0708        C  Second

     who  adult_male deck  embark_town alive  alone  is_child
1  woman       False    C    Cherbourg   yes  False     False
2  woman       False  NaN  Southampton   yes   True     False
3  woman       False    C  Southampton   yes  False     False
8  woman       False  NaN  Southampton   yes  False     False
9  child       False  NaN    Cherbourg   yes  False      True

### Sorting Data

In [13]:
# Sorting survivors by age

sorted_survivors = survivors.sort_values('age')

print(sorted_survivors.head())

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
803         1       3    male  0.42      0      1   8.5167        C   Third
755         1       2    male  0.67      1      1  14.5000        S  Second
469         1       3  female  0.75      2      1  19.2583        C   Third
644         1       3  female  0.75      2      1  19.2583        C   Third
78          1       2    male  0.83      0      2  29.0000        S  Second

       who  adult_male deck  embark_town alive  alone  is_child
803  child       False  NaN    Cherbourg   yes  False      True
755  child       False  NaN  Southampton   yes  False      True
469  child       False  NaN    Cherbourg   yes  False      True
644  child       False  NaN    Cherbourg   yes  False      True
78   child       False  NaN  Southampton   yes  False      True

In [20]:
# Sorting by multiple columns - age and pclass

sorted_survivors = survivors.sort_values(['pclass', 'age'], ascending=[False, True]) 

print(sorted_survivors.head())

     survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
803         1       3    male  0.42      0      1   8.5167        C  Third
469         1       3  female  0.75      2      1  19.2583        C  Third
644         1       3  female  0.75      2      1  19.2583        C  Third
172         1       3  female  1.00      1      1  11.1333        S  Third
381         1       3  female  1.00      0      2  15.7417        C  Third

       who  adult_male deck  embark_town alive  alone  is_child
803  child       False  NaN    Cherbourg   yes  False      True
469  child       False  NaN    Cherbourg   yes  False      True
644  child       False  NaN    Cherbourg   yes  False      True
172  child       False  NaN  Southampton   yes  False      True
381  child       False  NaN    Cherbourg   yes  False      True